# Дано предложение и количество раз, сколько его надо повторить. Напишите программу, которая повторяет
# данное предложение нужное количество раз.

sentences = input()
num = int(input())
for i in range(num):
    print(sentences)
