# На вход программе подается натуральное число n. Напишите программу, которая печатает звездный прямоугольник размерами n×19

num = int(input())
for i in range(num):
    print('*******************')