# На вход программе подается одна строка. Напишите программу, которая выводит:
# третий символ этой строки;
# предпоследний символ этой строки;
# первые пять символов этой строки;
# всю строку, кроме последних двух символов;
# все символы с четными индексами;
# все символы с нечетными индексами;
# все символы в обратном порядке;
# все символы строки через один в обратном порядке, начиная с последнего.

text = input()
counter = 0
for i in range(len(text)):
    counter += 1
print(text[2], text[-2], text[:5], text[: counter - 2], text[0::2], text[1::2], text[::-1], text[::-2], sep='\n')
