# На вход программе подается одно число  n. Напишите программу, которая выводит список [1, 2, 3, ..., n].

number_n = int(input())
print(list(range(1, number_n+1)))
