# На вход программе подается строка текста и строка-разделитель. Напишите программу, которая вставляет
# указанный разделитель между каждым символом введенной строки текста.

row_text = list(input())
print(input().join(row_text))
