# На вход программе подается строка текста, содержащая целые числа. Напишите программу,
# которая по заданным числам строит столбчатую диаграмму.


for _ in input().split(' '):
    print('+' * int(_))
