# Напишите программу, которая определяет, какой температуре по шкале Цельсия соответствует указанное значение по шкале Фаренгейта.
temperature_f = float(input())
print(5 / 9 * (temperature_f - 32))
