# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.

print(float(input())*float(input())*0.5)
