# Напишите программу, которая находит наименьшее и наибольшее из пяти чисел.
num_1 = int(input())
num_2 = int(input())
num_3 = int(input())
num_4 = int(input())
num_5 = int(input())

print('Max digit =', max(num_1, num_2, num_3, num_4, num_5))
print('Min digit =', min(num_1, num_2, num_3, num_4, num_5))
