# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.

side_a = float(input())
side_b = float(input())
print(side_a*side_b*0.5)
